Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/AccumulationRegisters/Inventory/Inventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Inventory</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>StructuralUnitCorr</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>CorrInventoryAccountType</name>
    <type>
      <types>EnumRef.InventoryAccountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsCorr</name>
    <type>
      <types>CatalogRef.Products</types>
      <types>CatalogRef.ManufacturingActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>CharacteristicCorr</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </attributes>
  <attributes>
    <name>BatchCorr</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </attributes>
  <attributes>
    <name>OwnershipCorr</name>
    <type>
      <types>CatalogRef.InventoryOwnership</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerCorrOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecificationCorr</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>CorrSalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceDocument</name>
    <type>
      <types>DocumentRef.InventoryWriteOff</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.GoodsReceipt</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.ShiftClosure</types>
      <types>DocumentRef.GoodsIssue</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>FixedCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionExpenses</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Return</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RetailTransferEarningAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OfflineRecord</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesRep</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>CostObjectCorr</name>
    <type>
      <types>CatalogRef.CostObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteCostObject</name>
    <type>
      <types>CatalogRef.CostObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CorrGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <attributes>
    <name>CorrIncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
      <types>CatalogRef.ManufacturingActivities</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ownership</name>
    <type>
      <types>CatalogRef.InventoryOwnership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CostObject</name>
    <type>
      <types>CatalogRef.CostObjects</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InventoryAccountType</name>
    <type>
      <types>EnumRef.InventoryAccountTypes</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccountingRegisters/AccountingJournalEntries/AccountingJournalEntries.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>AccountingJournalEntries</name>
  <chartOfAccounts>ChartOfAccounts.PrimaryChartOfAccounts</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
    <accountingFlag>ChartOfAccounts.PrimaryChartOfAccounts.AccountingFlag.Currency</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Status</name>
    <type>
      <types>EnumRef.AccountingEntriesStatus</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.PrimaryChartOfAccounts.AccountingFlag.Currency</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.PrimaryChartOfAccounts.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OfflineRecord</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionTemplate</name>
    <type>
      <types>CatalogRef.AccountingTransactionsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionTemplateLineNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfAccounting</name>
    <type>
      <types>CatalogRef.TypesOfAccounting</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Австралия/src/Enums/StockTransactionsMethodology/StockTransactionsMethodology.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StockTransactionsMethodology</name>
  <enumValues>
    <name>AngloSaxon</name>
  </enumValues>
  <enumValues>
    <name>Continental</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/VATRoundingRules/VATRoundingRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>VATRoundingRules</name>
  <enumValues>
    <name>PerLineTotal</name>
  </enumValues>
  <enumValues>
    <name>PerInvoiceTotal</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/PriceTypes/PriceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PriceTypes</name>
  <predefined>
    <items>
      <name>Wholesale</name>
      <description>Wholesale price</description>
    </items>
    <items>
      <name>Accounting</name>
      <description>Accounting price</description>
    </items>
  </predefined>
  <attributes>
    <name>PriceCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CalculatesDynamically</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PricesBaseKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Percent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceCalculationMethod</name>
    <type>
      <types>EnumRef.PriceCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Formula</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OperandID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/InformationRegisters/AccountingPolicy/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Function AccountingPolicyIsSet(Date, Company) Export
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	TRUE AS IsSet
	|FROM
	|	InformationRegister.AccountingPolicy.SliceLast(&Date, Company = &Company) AS AccountingPolicySliceLast";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("Company", Company);
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

Function GetAccountingPolicy(Val Date = Undefined, Val Company = Undefined, UseException = True) Export
	
	StructureToReturn = New Structure;
	StructureToReturn.Insert("RegisteredForVAT"							, False);
	StructureToReturn.Insert("DefaultVATRate"							, Undefined);
	StructureToReturn.Insert("CashMethodOfAccounting"					, Undefined);
	StructureToReturn.Insert("InventoryValuationMethod"					, Undefined);
	StructureToReturn.Insert("UseGoodsReturnFromCustomer"				, False);
	StructureToReturn.Insert("UseGoodsReturnToSupplier"					, False);
	StructureToReturn.Insert("PostVATEntriesBySourceDocuments"			, True);
	StructureToReturn.Insert("PostAdvancePaymentsBySourceDocuments"		, False);
	StructureToReturn.Insert("IssueAutomaticallyAgainstSales"			, False);
	StructureToReturn.Insert("StockTransactionsMethodology"				, Undefined);
	StructureToReturn.Insert("ContinentalMethod"						, False);
	StructureToReturn.Insert("ManufacturingOverheadsAllocationMethod"	, Undefined);
	StructureToReturn.Insert("VATRoundingRule"							, Undefined);
	StructureToReturn.Insert("PerInvoiceVATRoundingRule"				, False);
	StructureToReturn.Insert("RegisteredForSalesTax"					, False);
	StructureToReturn.Insert("PostExpensesByWorkOrder"					, False);
	StructureToReturn.Insert("UnderOverAllocatedOverheadsSetting"		, Undefined);
	StructureToReturn.Insert("RegisterDeliveryDateInInvoices"			, False);
	StructureToReturn.Insert("InventoryDispatchingStrategy"				, Undefined);
	StructureToReturn.Insert("AccountingPrice"							, Undefined);
	StructureToReturn.Insert("UseTemplates"								, False);
	
	If Not ValueIsFilled(Company) Then
		Company = DriveReUse.GetValueOfSetting("MainCompany");
	EndIf;
	
	If Not ValueIsFilled(Company) Then
		Company = DriveServer.GetPredefinedCompany();
	EndIf;
	
	If Not ValueIsFilled(Company) Then
		Return StructureToReturn;
	EndIf;
	
	If Not ValueIsFilled(Date) Then
		Date = CurrentSessionDate();
	EndIf;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	AccountingPolicySliceLast.DefaultVATRate AS DefaultVATRate,
	|	AccountingPolicySliceLast.RegisteredForVAT AS RegisteredForVAT,
	|	AccountingPolicySliceLast.RegisteredForSalesTax AS RegisteredForSalesTax,
	|	AccountingPolicySliceLast.CashMethodOfAccounting AS CashMethodOfAccounting,
	|	AccountingPolicySliceLast.InventoryValuationMethod AS InventoryValuationMethod,
	|	AccountingPolicySliceLast.UseGoodsReturnFromCustomer AS UseGoodsReturnFromCustomer,
	|	AccountingPolicySliceLast.UseGoodsReturnToSupplier AS UseGoodsReturnToSupplier,
	|	AccountingPolicySliceLast.PostVATEntriesBySourceDocuments AS PostVATEntriesBySourceDocuments,
	|	AccountingPolicySliceLast.PostAdvancePaymentsBySourceDocuments AS PostAdvancePaymentsBySourceDocuments,
	|	AccountingPolicySliceLast.IssueAutomaticallyAgainstSales AS IssueAutomaticallyAgainstSales,
	|	AccountingPolicySliceLast.StockTransactionsMethodology AS StockTransactionsMethodology,
	|	AccountingPolicySliceLast.StockTransactionsMethodology = VALUE(Enum.StockTransactionsMethodology.Continental) AS ContinentalMethod,
	|	AccountingPolicySliceLast.ManufacturingOverheadsAllocationMethod AS ManufacturingOverheadsAllocationMethod,
	|	AccountingPolicySliceLast.VATRoundingRule AS VATRoundingRule,
	|	AccountingPolicySliceLast.VATRoundingRule = VALUE(Enum.VATRoundingRules.PerInvoiceTotal) AS PerInvoiceVATRoundingRule,
	|	AccountingPolicySliceLast.PostExpensesByWorkOrder AS PostExpensesByWorkOrder,
	|	AccountingPolicySliceLast.UnderOverAllocatedOverheadsSetting AS UnderOverAllocatedOverheadsSetting,
	|	AccountingPolicySliceLast.RegisterDeliveryDateInInvoices AS RegisterDeliveryDateInInvoices,
	|	AccountingPolicySliceLast.InventoryDispatchingStrategy AS InventoryDispatchingStrategy,
	|	CASE
	|		WHEN PriceTypes.DeletionMark
	|			THEN VALUE(CAtalog.PriceTypes.Emptyref)
	|		ELSE AccountingPolicySliceLast.AccountingPrice
	|	END AS AccountingPrice,
	|	&UseTemplates AS UseTemplates
	|FROM
	|	InformationRegister.AccountingPolicy.SliceLast(&Date, Company = &Company) AS AccountingPolicySliceLast
	|		LEFT JOIN Catalog.PriceTypes AS PriceTypes
	|		ON AccountingPolicySliceLast.AccountingPrice = PriceTypes.Ref";
	
	Query.SetParameter("Date"			, Date);
	Query.SetParameter("Company"		, Company);
	Query.SetParameter("UseTemplates"	, Constants.AccountingModuleSettings.UseTemplatesIsEnabled());
	
	QueryResult = Query.Execute();
	
	If QueryResult.IsEmpty() Then
		
		MessageText = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'The Accounting policy is required for %1.
				|Go to Company > Enterprise > Accounting policy and create the Accounting policy for this company.'; 
				|ru = 'Требуется учетная политика для %1. 
				|Перейдите в Организация > Предприятие > Учетная политика и создайте учетную политику для данной организации.';
				|pl = 'Polityka rachunkowości jest wymagana dla %1.  
				|Przejdź do Firma > Przedsiębiorstwo > Polityka rachunkowości i utwórz Politykę rachunkowości dla tej firmy.';
				|es_ES = 'Se requiere la Política de contabilidad para %1.
				|Vaya a Empresa > Empresa > Política de Contabilidad y cree la Política de Contabilidad para esta empresa.';
				|es_CO = 'Se requiere la Política de contabilidad para %1.
				|Vaya a Empresa > Empresa > Política de Contabilidad y cree la Política de Contabilidad para esta empresa.';
				|tr = '%1 için muhasebe politikası gerekli. 
				|İş yeri > Kurum > Muhasebe politikası bölümünde bu iş yeri için Muhasebe politikası oluşturun.';
				|it = 'La politica contabile è richiesta per %1. 
				|Vai in Azienda > Impresa > Politica contabile e creare la politica contabile per questa azienda.';
				|de = 'Die Bilanzierungsrichtlinien sind für %1 erforderlich.  
				|Gehen Sie zu Firma > Unternehmen > Adressen > Bilanzierungsrichtlinien und erstellen Sie für diese Firma Bilanzierungsrichtlinien.'"),
			Company);
			
		If UseException = True Then
			Raise MessageText;
		ElsIf UseException = False Then
			CommonClientServer.MessageToUser(MessageText);
		EndIf;
		
	Else
		
		Selection = QueryResult.Select();
		Selection.Next();
		FillPropertyValues(StructureToReturn, Selection);
		
	EndIf;
	
	Return StructureToReturn;
	
EndFunction

Function GetDefaultVATRate(Val Date = Undefined, Val Company = Undefined) Export
	
	Policy = GetAccountingPolicy(Date, Company);
	Return DefaultVATRateFromAccountingPolicy(Policy);
	
EndFunction

Function DefaultVATRateFromAccountingPolicy(Policy) Export
	
	Return ?(Policy.DefaultVATRate = Catalogs.VATRates.EmptyRef(), 
		Catalogs.VATRates.Exempt, 
		Policy.DefaultVATRate);
	
EndFunction

Function InventoryValuationMethod(Val Date = Undefined, Val Company = Undefined) Export
	
	Policy = GetAccountingPolicy(Date, Company);
	
	Return Policy.InventoryValuationMethod;
	
EndFunction

Function ContinentalStockTransactionsMethodologyIsEnabled() Export
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	TRUE
	|FROM
	|	InformationRegister.AccountingPolicy AS AccountingPolicy
	|WHERE
	|	AccountingPolicy.StockTransactionsMethodology = VALUE(Enum.StockTransactionsMethodology.Continental)";
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

// Function returns the key of the register record.
//
Function GetRecordKey(ParametersStructure) Export
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED TOP 1
	|	AccountingPolicySliceLast.Period AS Period
	|FROM
	|	InformationRegister.AccountingPolicy.SliceLast(&ToDate, Company = &Company) AS AccountingPolicySliceLast";
	
	Query.SetParameter("ToDate", ParametersStructure.Period);
	Query.SetParameter("Company", ParametersStructure.Company);
	
	ReturnStructure = New Structure("RecordExists, Period, Company", False);
	FillPropertyValues(ReturnStructure, ParametersStructure);
	
	ResultTable = Query.Execute().Unload();
	If ResultTable.Count() > 0 Then
		
		ReturnStructure.Period = ResultTable[0].Period;
		ReturnStructure.RecordExists = True;
		
	EndIf;
	
	Return ReturnStructure;
	
EndFunction

Function ModifyDeleteIsAllowed(ParametersData) Export
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	CreditNote.Ref AS Ref
	|FROM
	|	Document.CreditNote AS CreditNote
	|WHERE
	|	CreditNote.Posted
	|	AND CreditNote.Date >= &Period
	|	AND CreditNote.Company IN(&Companies)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	DebitNote.Ref
	|FROM
	|	Document.DebitNote AS DebitNote
	|WHERE
	|	DebitNote.Posted
	|	AND DebitNote.Date >= &Period
	|	AND DebitNote.Company IN(&Companies)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	GoodsReceipt.Ref
	|FROM
	|	Document.GoodsReceipt AS GoodsReceipt
	|WHERE
	|	GoodsReceipt.Posted
	|	AND GoodsReceipt.Date >= &Period
	|	AND GoodsReceipt.Company IN(&Companies)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	GoodsIssue.Ref
	|FROM
	|	Document.GoodsIssue AS GoodsIssue
	|WHERE
	|	GoodsIssue.Posted
	|	AND GoodsIssue.Date >= &Period
	|	AND GoodsIssue.Company IN(&Companies)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	SupplierInvoice.Ref
	|FROM
	|	Document.SupplierInvoice AS SupplierInvoice
	|WHERE
	|	SupplierInvoice.Posted
	|	AND SupplierInvoice.Date >= &Period
	|	AND SupplierInvoice.Company IN(&Companies)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	Inventory.Recorder
	|FROM
	|	AccumulationRegister.Inventory AS Inventory
	|WHERE
	|	Inventory.Period >= &Period
	|	AND Inventory.Company IN(&Companies)";
	
	Query.SetParameter("Companies",	ParametersData.Companies);
	Query.SetParameter("Period",	ParametersData.Period);
	
	Return Query.Execute().IsEmpty();
	
EndFunction

Function CheckDocumentsAfterSettingPeriod(ParametersData) Export
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	AccountingJournalEntries.Recorder AS Ref
	|FROM
	|	AccountingRegister.AccountingJournalEntries AS AccountingJournalEntries
	|WHERE
	|	AccountingJournalEntries.Period >= &Period
	|	AND AccountingJournalEntries.Company IN(&Companies)";
	
	Query.SetParameter("Companies",	ParametersData.Companies);
	Query.SetParameter("Period",	ParametersData.Period);
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

Function AccountingPolicyTableQueryText() Export
	
	QueryText =
	"SELECT
	| *
	|INTO AccountingPolicy
	|FROM
	|	InformationRegister.AccountingPolicy.SliceLast(&Period, Company = &Company) AS AccountingPolicySliceLast";
	
	Return QueryText;
	
EndFunction

Function CheckPeriodOnClosingDates(Company, Date) Export
	
	Source = InformationRegisters.AccountingPolicy.CreateRecordSet();
	Source.Filter.Period.Set(Date);
	Source.Filter.Company.Set(Company);
	SourceRecord = Source.Add();
	SourceRecord.Period = Date;
	SourceRecord.Company = Company;
	
	Cancel = PeriodClosingDates.DataChangesDenied(Source);
	
	Return Cancel;
	
EndFunction

#EndRegion

#EndIf
